Reports/ВыполнениеПлановАктивности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>ВыполнениеПлановАктивности</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Волна</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланАктивности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Documents/ПланАктивности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПланАктивности</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПланАктивности</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Активность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТоварнаяМарка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеМарки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, создавший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Планы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелеваяМарка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦелевыеМарки</v8:Type>
								<v8:Type>cfg:CatalogRef.ТоварныеМарки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПериодаАктивности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Периоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидПериода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыПериодаАктивности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеДействия</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>35</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦелеваяМарка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ЦелевыеМарки</v8:Type>
								<v8:Type>cfg:CatalogRef.ТоварныеМарки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолеСвязи</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Расчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Порог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Напоказ</Name>
					<Comment>Служит для визуализации поанов</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СкладКомпании</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Куратор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ВыполнениеПлановАктивности/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.ПараметрСсылка) И Параметры.ПараметрСсылка.Проведен Тогда
		Отчет.Волна = Параметры.ПараметрСсылка;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПланАктивности.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПланАктивности КАК ПланАктивности
		|ГДЕ
		|	ПланАктивности.Проведен
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ
		|АВТОУПОРЯДОЧИВАНИЕ";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			Отчет.Волна = ВыборкаДетальныеЗаписи.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если Отчет.Волна.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПланПоАктивности") Тогда
		спОтчеты.Добавить("Ленточки",,Истина,БиблиотекаКартинок.Отчеты);
		спОтчеты.Добавить("Премия",,Истина,БиблиотекаКартинок.РазделФинансы16);
		спОтчеты.Добавить("Итого",,Истина,БиблиотекаКартинок.Сумма);
	Иначе
		спОтчеты.Добавить("Выполнение","Выполнение плана",Истина,БиблиотекаКартинок.Отчеты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Каталог = КаталогДокументов();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьКнигу(Книга,Представление)
	
	ИмяФайла = СтрЗаменить(СокрЛП(Отчет.Волна),":","`") + " " + Представление + " " + Формат(ТекущаяДата(),"ДФ=yyyy-MM-dd") +".XlsX";
	
	ПолноеИмяФайла = Каталог + "\" + ИмяФайла;
	
	Попытка
		Если ТипЗнч(Книга) = Тип("ПакетОтображаемыхДокументов") Тогда
			Книга.Записать(ПолноеИмяФайла, ТипФайлаПакетаОтображаемыхДокументов.XLSX);
		Иначе
			Книга.Записать(ПолноеИмяФайла, ТипФайлаТабличногоДокумента.XLSX);
		КонецЕсли;
	Исключение
		ВсЁОк = Ложь;
		ТекстОшибки = " Не удалось создать файл! " + ОписаниеОшибки();
		Сообщить(ТекстОшибки);
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция СформироватьНаСервере(ВидОтчета)
	Возврат Отчеты.ВыполнениеПлановАктивности.СформироватьОтчет(Отчет.Волна,ВидОтчета,Ложь);
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда)
	Для Каждого стрОтчет Из спОтчеты Цикл
		Если стрОтчет.Пометка Тогда
			Книга = СформироватьНаСервере(стрОтчет.Значение);
			СохранитьКнигу(Книга,стрОтчет.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	Диалог.Каталог = Каталог; 
	Диалог.МножественныйВыбор = Ложь; 
	Диалог.Заголовок = "Выберите каталог"; 
	//Если пользователь не нажал кнопку ОТМЕНА в диалоге
	Если Диалог.Выбрать() Тогда
		Каталог = Диалог.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВолнаПриИзменении(Элемент)
	ВолнаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВолнаПриИзмененииНаСервере()
	спОтчеты.Очистить();
	Если Отчет.Волна.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ПланПоАктивности") Тогда
		спОтчеты.Добавить("Ленточки",,Истина,БиблиотекаКартинок.Отчеты);
		спОтчеты.Добавить("Премия",,Истина,БиблиотекаКартинок.РазделФинансы16);
		спОтчеты.Добавить("Итого",,Истина,БиблиотекаКартинок.Сумма);
	Иначе
		спОтчеты.Добавить("Выполнение","Выполнение плана",Истина,БиблиотекаКартинок.Отчеты);
	КонецЕсли;
КонецПроцедуры
